---
type: AnalyticalNodeData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# AnalyticalNodeData

`Autodesk.Revit.DB.Structure.AnalyticalNodeData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAnalyticalNodeData | 2021 | `public static AnalyticalNodeData GetAnalyticalNodeData ( Element element )` |
| Method | GetConnectionStatus | 2021 | `public AnalyticalNodeConnectionStatus GetConnectionStatus ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |